Catalogs/бит_ШаблоныВыгрузкиГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныВыгрузкиГИСЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияШаблона</Name>
					<Comment>Используется для выборочного обновления типовых макетов.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Comment>Используется для выборочного обновления типовых макетов.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетСтраницы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНачальнойСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыДомовГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыДомовГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПлатежныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраницаКолонка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНачальнойСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СКДТаблицГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СКДТаблицГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТаблицаШаблонаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТаблицыШаблоновГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ШаблоныВыгрузкиГИСЖКХ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мСоответствиеПараметровМакета; // Соответствие полей и таблиц из СКД.

&НаКлиенте
Перем мРодитель;	// Уровень в дереве доступных полей (чтобы не перезаполнять список выбора лишний раз).

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Период = ТекущаяДата(); // Дата среза для регистра сведений хранящего СКД.
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗначениеКопирования = Истина;
		ЗаполнитьДеревоДоступныеПоля();
	КонецЕсли;
	
	Элементы.УслугаСодержания.Видимость = Объект.ШаблонПлатежныхДокументов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСоответствиеПараметровМакета();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеКопирования Тогда
		ОбновитьДеревоПолей();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДеревоДоступныеПоля();
	НастройкиДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ПутьКШаблону) Тогда
		Попытка
			ДвоичныеДанныеМакета = Новый ДвоичныеДанные(ПутьКШаблону);
			
			// Если не задано имя даем шаблону наименование файла.
			Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
				СокрПуть = СокрЛП(ПутьКШаблону);
				РазделительПутиОС = ПолучитьРазделительПути();
				ПозицияРазделителя = СтрНайти(СокрПуть, РазделительПутиОС, НаправлениеПоиска.СКонца) + 1;
				ПозицияРасширения  = СтрНайти(СокрПуть, ".", НаправлениеПоиска.СКонца);
				Объект.Наименование = Сред(СокрПуть, ПозицияРазделителя, ПозицияРасширения - ПозицияРазделителя);
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'Макет не сохранен. Необходимо проверить путь к шаблону!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		
		// Пользовательские шаблоны можно формировать только из своих таблиц.
		ТаблицыГИСЖКХ = ДоступныеПоля.ПолучитьЭлементы();
		Если ТаблицыГИСЖКХ.Количество() > 0 Тогда
			
			Для Каждого Стр Из ТаблицыГИСЖКХ Цикл
				
				Попытка
					Предопределенный = ЗначениеРеквизитаНаСервере(Стр.Поле, "Предопределенный");
					Если ЗначениеЗаполнено(Предопределенный) И Предопределенный Тогда
						Объект.ПользовательскийШаблон = Ложь;
						Возврат; 
					КонецЕсли;
				Исключение
					Продолжить;
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		//Режим = РежимДиалогаВопрос.ДаНет;
		//Текст = "ru = 'Шаблон был изменен, сохранить его как пользовательский вариант? (Пользовательские варианты шаблонов сохраняются после обновления программы)'";
		//Ответ = Вопрос(НСтр(Текст), Режим, 0);
		//Если Ответ = КодВозвратаДиалога.Да Тогда
		//	Объект.ПользовательскийШаблон = Истина;
		//КонецЕсли;
		Объект.ПользовательскийШаблон = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ПутьКШаблону)
		И ЗначениеЗаполнено(ДвоичныеДанныеМакета) Тогда
		Попытка
			ТекущийОбъект.МакетСтраницы = Новый ХранилищеЗначения(ДвоичныеДанныеМакета);
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка сохранения выбранного макета!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	// Заполнить ТаблицуПолейШаблона.
	ЗаполнитьТаблицуПолейШаблона(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиДоступа();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьСоответствиеПараметровМакета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКШаблонуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РазделительПутиОС = ПолучитьРазделительПути();
	Длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Длг.Заголовок = "Укажите файл";
	Длг.Фильтр    = "(*.xlsx;*.xls)|*.xlsx;*.xls";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПутьФайлаЗавершение", ЭтотОбъект);
	Длг.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьФайлаЗавершение(ВыбранныеФайлы, ВходящийКонтекст) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда 
		ПутьКШаблону = ВыбранныеФайлы[0];
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПлатежныхДокументовПриИзменении(Элемент)
	
	Элементы.УслугаСодержания.Видимость = Объект.ШаблонПлатежныхДокументов;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Родитель = Элемент.ТекущиеДанные.ПолучитьРодителя();
	СписокВыбора = Элементы.ДоступныеПоляПоле.СписокВыбора;
	
	Если (Родитель = Неопределено 
		И НЕ мРодитель = Родитель)
		ИЛИ СписокВыбора.Количество() = 0 Тогда
		Элементы.ДоступныеПоляПоле.СписокВыбора.Очистить();
		Элементы.ДоступныеПоляПоле.СписокВыбора.ЗагрузитьЗначения(ТаблицаТаблиц.ВыгрузитьЗначения());
		Элементы.ДоступныеПоляНомерНачальнойСтроки.ТолькоПросмотр = Ложь;
		мРодитель = Родитель;
	ИначеЕсли НЕ Родитель = мРодитель Тогда
		Элементы.ДоступныеПоляПоле.СписокВыбора.Очистить();
		Если ЗначениеЗаполнено(Родитель.Поле) Тогда
			Элементы.ДоступныеПоляПоле.СписокВыбора.ЗагрузитьЗначения(мСоответствиеПараметровМакета[Родитель.Поле]);
		КонецЕсли;
		Элементы.ДоступныеПоляНомерНачальнойСтроки.ТолькоПросмотр = Истина;
		мРодитель = Родитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляКолонкаПриИзменении(Элемент)
	
	ТекЭлт = Элементы.ДоступныеПоля.ТекущиеДанные;
	Родитель = ТекЭлт.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Списокродителей = ДоступныеПоля.ПолучитьЭлементы();
		Для Каждого Элт Из СписокРодителей Цикл
			Если НЕ ТекЭлт.СтраницаКолонка = 0
				И НЕ Элт.Поле = ТекЭлт.Поле
				И Элт.СтраницаКолонка = ТекЭлт.СтраницаКолонка Тогда
				ТекЭлт.СтраницаКолонка = 0;
				ТекстСообщения = НСтр("ru = 'Номер не уникален!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе	
		СписокПодчиненных = Родитель.ПолучитьЭлементы();
		Для Каждого Элт Из СписокПодчиненных Цикл
			Если НЕ ТекЭлт.СтраницаКолонка = 0
				И НЕ Элт.Поле = ТекЭлт.Поле
				И Элт.СтраницаКолонка = ТекЭлт.СтраницаКолонка Тогда
				ТекЭлт.СтраницаКолонка = 0;
				ТекстСообщения = НСтр("ru = 'Номер не уникален!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляПолеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекЭлт = Элементы.ДоступныеПоля.ТекущиеДанные;
	Родитель = ТекЭлт.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Списокродителей = ДоступныеПоля.ПолучитьЭлементы();
		Для Каждого Элт Из Списокродителей Цикл
			Если Элт.Поле = ВыбранноеЗначение Тогда
				// ВыбранноеЗначение = "";
				ТекстСообщения = НСтр("ru = 'Элемент уже используется!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				СтандартнаяОбработка = Ложь;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		// Заполнение новой таблицы.
		ПодчинЭлты      = ТекЭлт.ПолучитьЭлементы();
		ПодчинЭлты.Очистить();
		Для каждого Элт Из мСоответствиеПараметровМакета[ВыбранноеЗначение] Цикл
			НовоеПоле      = ПодчинЭлты.Добавить();
			НовоеПоле.Поле = Элт;
		КонецЦикла;
		
	Иначе	
		СписокПодчиненных = Родитель.ПолучитьЭлементы();
		Для Каждого Элт Из СписокПодчиненных Цикл
			Если Элт.Поле = ВыбранноеЗначение Тогда
				// ВыбранноеЗначение = "";
				ТекстСообщения = НСтр("ru = 'Элемент уже используется!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				СтандартнаяОбработка = Ложь;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Ур = Уровень(Элемент.ТекущиеДанные);
	
	Если Ур > 0 
		ИЛИ Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Добавляем элемент в группу Таблицы.
	Если Ур = 1 Тогда
		Родитель = Элемент.ТекущиеДанные.ПолучитьРодителя();
		КоллекцияЭлтов = Родитель.ПолучитьЭлементы();
		КоллекцияЭлтов.Добавить();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	
	Корень = ДоступныеПоля.ПолучитьЭлементы();
	Корень.Добавить();
	Элементы.ДоступныеПоляНомерНачальнойСтроки.ТолькоПросмотр = Ложь;
	Элементы.ДоступныеПоляПоле.СписокВыбора.Очистить();
	Элементы.ДоступныеПоляПоле.СписокВыбора.ЗагрузитьЗначения(ТаблицаТаблиц.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМакет(Команда)
	
	#Если НЕ ВебКлиент Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ДвоичныеДанныеПросмтотраМакета = ПолучитьМакет(Объект.Ссылка);
			ИмяВрФайла = ПолучитьИмяВременногоФайла("xlsx");
			ДвоичныеДанныеПросмтотраМакета.Записать(ИмяВрФайла);
			ЗапуститьПриложение(ИмяВрФайла);	
		КонецЕсли;	
	#Иначе
		Возврат;	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПолейКоманда(Команда)
	
	ТекстВопроса = НСтр("ru='Текущая разметка макета будет удалена. Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДеревоПолейКомандаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПолейКомандаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСоответствиеПараметровМакета();	
		ОбновитьДеревоПолей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоДоступныеПоля()
	
	ДоступныеПоля.ПолучитьЭлементы().Очистить();
	Дерево = РеквизитФормыВЗначение("ДоступныеПоля");
	ТЗПолей = Объект.ПоляШаблона.Выгрузить();
	Если ТЗПолей.Количество() > 0 Тогда
		ЗаполнитьДеревоДоступныхПолей(ТЗПолей, Дерево);
	КонецЕсли;
	ЗначениеВРеквизитФормы(Дерево,"ДоступныеПоля");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоДоступныхПолей(ТаблицаПолей, Дерево)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.ИмяТаблицы КАК ИмяТаблицы,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.Поле,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.СтраницаКолонка,
	|	бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона.НомерНачальнойСтроки
	|ПОМЕСТИТЬ ВТ_ПоляШаблона
	|ИЗ
	|	&ТаблицаПолей КАК бит_ШаблоныВыгрузкиГИСЖКХПоляШаблона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоляШаблона.ИмяТаблицы КАК ИмяТаблицы,
	|	ВТ_ПоляШаблона.Поле,
	|	ВТ_ПоляШаблона.СтраницаКолонка,
	|	ВТ_ПоляШаблона.НомерНачальнойСтроки
	|ИЗ
	|	ВТ_ПоляШаблона КАК ВТ_ПоляШаблона
	|ИТОГИ ПО
	|	ИмяТаблицы";
	
	Запрос.УстановитьПараметр("ТаблицаПолей",ТаблицаПолей);
	
	ВыборкаТаблиц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	// Обход по названию таблицы.
	Пока ВыборкаТаблиц.Следующий() Цикл
		КоллекцияСтрокРодитлей = Дерево.Строки;
		НСтрокаРодитель = КоллекцияСтрокРодитлей.Добавить();
		НСтрокаРодитель.Поле			= ВыборкаТаблиц.ИмяТаблицы;
		
		ВыборкаПолей = ВыборкаТаблиц.Выбрать();
		Пока ВыборкаПолей.Следующий() Цикл
			// Дозаполняем данные родителя.
			Если ВыборкаПолей.ИмяТаблицы = ВыборкаПолей.Поле Тогда
				НСтрокаРодитель.СтраницаКолонка		 = ВыборкаПолей.СтраницаКолонка;
				НСтрокаРодитель.НомерНачальнойСтроки = ВыборкаПолей.НомерНачальнойСтроки;
				Продолжить;
			КонецЕсли;
			
			КоллекцияСтрокРодитлейПолей = НСтрокаРодитель.Строки;
			НСтрокаПоля = КоллекцияСтрокРодитлейПолей.Добавить();
			НСтрокаПоля.Поле			= ВыборкаПолей.Поле;
			НСтрокаПоля.СтраницаКолонка = ВыборкаПолей.СтраницаКолонка;
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура НастройкиДоступа()
	
	Если ПолучитьМакет(Объект.Ссылка) = Неопределено Тогда
		Элементы.ФормаОткрытьМакет.Доступность = Ложь;
	Иначе
		Элементы.ФормаОткрытьМакет.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПолей()
	
	Корень = ДоступныеПоля.ПолучитьЭлементы();
	Корень.Очистить();
	
	Для Каждого Элт Из мСоответствиеПараметровМакета Цикл
		ПолеТаблицыПараметров	   = Корень.Добавить();
		ПолеТаблицыПараметров.Поле = Элт.Ключ;
		
		ПолеТаблицыПараметров      = ПолеТаблицыПараметров.ПолучитьЭлементы();
		ПолеТаблицыПараметров.Очистить();
		Для каждого Колонка Из Элт.Значение Цикл
			НовоеПоле      = ПолеТаблицыПараметров.Добавить();
			НовоеПоле.Поле = Колонка;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Уровень(СтрокаДерева)
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Возврат ?(Родитель = Неопределено, 0, 1 + Уровень(Родитель));
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСоответствиеПараметровМакета()
	
	мСоответствиеПараметровМакета.Очистить();
	мСоответствиеПараметровМакета = ПолучитьСоответствиеПараметровМакета(Объект.Период);	
	
	ТаблицаТаблиц.Очистить();
	Для Каждого Элт Из мСоответствиеПараметровМакета Цикл
		ТаблицаТаблиц.Добавить(Элт.Ключ);
	КонецЦикла;

КонецПроцедуры

// Получения информации о наборе данных, из актуальных на дату запроса схем компоновки данных.
&НаСервереБезКонтекста
Функция ПолучитьСоответствиеПараметровМакета(Дата)
	
	СоответствиеПараметровМакета = Новый Соответствие(); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СКДТаблицГИСЖКХСрезПоследних.ТаблицаШаблонаГИСЖКХ КАК ТаблицаШаблонаГИСЖКХ,
	|	бит_СКДТаблицГИСЖКХСрезПоследних.СхемаКомпоновкиДанных
	|ИЗ
	|	РегистрСведений.бит_СКДТаблицГИСЖКХ.СрезПоследних(&Дата, ) КАК бит_СКДТаблицГИСЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СКД = Выборка.СхемаКомпоновкиДанных.Получить();
		
		Если СКД = Неопределено Тогда
			Продолжить; // Пустую не заполняем.	
		КонецЕсли;
		
		КолонкиШаблона = Новый Массив;
		ВыборкаПолей = СКД.НастройкиПоУмолчанию.Выбор.Элементы;
		Для каждого Элт Из ВыборкаПолей Цикл
			КолонкиШаблона.Добавить(Строка(Элт.Поле));
		КонецЦикла;
		
		СоответствиеПараметровМакета.Вставить(Выборка.ТаблицаШаблонаГИСЖКХ,КолонкиШаблона);
	КонецЦикла; 
	
	Возврат СоответствиеПараметровМакета; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМакет(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "МакетСтраницы").Получить();
	
КонецФункции

// Перенос дерева из реквизита формы в табличную часть объекта.
&НаСервере
Процедура ЗаполнитьТаблицуПолейШаблона(Объект)
	
	Объект.ПоляШаблона.Очистить();
	ЗаполнитьТаблицу(ДоступныеПоля.ПолучитьЭлементы(), Объект.ПоляШаблона);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТаблицу(КоллекцияЭлементов , Таблица, ИмяТаблицы = Неопределено)
	
	Для Каждого Строка Из КоллекцияЭлементов Цикл
		
		Подстрока = Строка.ПолучитьЭлементы();
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Поле				 = Строка.Поле;
		НоваяСтрока.СтраницаКолонка		 = Строка.СтраницаКолонка;
		НоваяСтрока.НомерНачальнойСтроки = Строка.НомерНачальнойСтроки;
		
		//Если  Подстрока.Количество() > 0 Тогда
		Если ТипЗнч(Строка.Поле) = Тип("СправочникСсылка.бит_ТаблицыШаблоновГИСЖКХ") Тогда // Это Таблица.
			НоваяСтрока.ИмяТаблицы = Строка.Поле;
			// Ркурсивно заполняем подчиненные элементы.
			Если Подстрока.Количество() > 0 Тогда
				ЗаполнитьТаблицу(Подстрока, Таблица, Строка.Поле);
			КонецЕсли;
		Иначе
			НоваяСтрока.ИмяТаблицы = ИмяТаблицы;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка, Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	
	
КонецФункции

мСоответствиеПараметровМакета = Новый Соответствие();

#КонецОбласти
